app/controllers/calendars_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "entitlements"."courseId" FROM "entitlements" WHERE "entitlements"."uni" = ?  [["uni", "testUni2"]]
SELECT "calendars".* FROM "calendars" WHERE "calendars"."class_id" IN ('COMS 4152', 'CSOR 4231')
---
    def index
      if not params.key?(:year)
        current_sunday = get_last_sunday_date(Date.today)
      else
        current_sunday = Date.new(params[:year].to_i, params[:month].to_i, params[:day].to_i)
      end
      #debugger()
      user_id = session[:user_id]
      user = User.find_by(id: user_id)
      uni = user.uni

      @year = current_sunday.year
      @month = current_sunday.month
      @day = current_sunday.day

      dtstart = DateTime.new(@year, @month, @day)
      dtend = dtstart + 7

      classes = Entitlement.where(uni: uni).pluck(:courseId)
      @calendars = Calendar.where(class_id: classes).where('start_time >= ? AND end_time < ?', dtstart, dtend).order(:start_time)
      @calendars = @calendars.map do |calendar|

SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT 1  [["id", 17]]
DELETE FROM "calendars" WHERE "calendars"."id" = ?  [["id", 17]]
---
    def destroy
      @calendar = Calendar.find(params[:id])
      @calendar.destroy

SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT 1  [["id", 16]]
---
    def edit
      @calendar = Calendar.find(params[:id])