app/controllers/entitlements_controller.rb

    def create
        course_name = entitlement_params[:courseName]
        input_course = Course.find_by(courseName: course_name)
        if input_course.nil?
            flash[:warning] = "No such class exists. Please input a valid class."
        else
            if Entitlement.equivalent_perm_exists?(current_user.uni, input_course.id, entitlement_params[:role])
                flash[:warning] = "You already have access to the inputted class."
            else
                new_entitlement = Entitlement.create(uni: current_user.uni, courseId: input_course.id, role: entitlement_params[:role])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."courseName" = ? LIMIT 1  [["courseName", "COMS 4152"]]
INSERT INTO "entitlements" ("uni", "courseId", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["uni", "testUni"], ["courseId", 1], ["role", "Viewer"], ["created_at", "2023-10-29 01:47:17.732577"], ["updated_at", "2023-10-29 01:47:17.732577"]]