app/controllers/professors_controller.rb

    def index
      @viewable_courses = Hash.new
        @entitlements = Entitlement.where(uni: current_user.uni, role: "Prof")
        @entitlements.each do |entitlement|
          potential_course = Course.find_by(courseName: entitlement.courseName)
            if not potential_course.nil?
              @tas = Entitlement.where(courseName: potential_course.courseName, role: "TA")
---
SELECT "entitlements".* FROM "entitlements" WHERE "entitlements"."uni" = ? AND "entitlements"."role" = ?  [["uni", "testUni"], ["role", "Prof"]]
SELECT  "courses".* FROM "courses" WHERE "courses"."courseName" = ? LIMIT 1  [["courseName", "COMS 4152"]]
SELECT  "courses".* FROM "courses" WHERE "courses"."courseName" = ? AND "courses"."role" = 'Prof' LIMIT 1  [["courseName", "COMS 4152"]]

    def create
      name = professors_params[:courseName]
      description = professors_params[:courseDescription]
      unis =professors_params[:unis]

      if Course.find_by(courseName: name).nil?
        course = Course.create!({:courseName => name, :courseDescription => description})
        Entitlement.create!({:uni => current_user.uni, :courseName => course.courseName, :role => "Prof"})
---
SELECT  "courses".* FROM "courses" WHERE "courses"."courseName" = ? LIMIT 1  [["courseName", "test"]]
INSERT INTO "courses" ("courseName", "courseDescription", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["courseName", "test"], ["courseDescription", "test"], ["created_at", "2023-10-31 22:47:36.297294"], ["updated_at", "2023-10-31 22:47:36.297294"]]
INSERT INTO "entitlements" ("uni", "courseId", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["uni", "ss5945"], ["courseId", 1], ["role", "Prof"], ["created_at", "2023-10-31 22:47:36.378672"], ["updated_at", "2023-10-31 22:47:36.378672"]]