app/controllers/professors_controller.rb

    def index
      @viewable_courses = Set.new
        @entitlements = Entitlement.where(uni: current_user.uni)
        @entitlements.each do |entitlement|
            if not Course.find_by(id: entitlement.courseId).nil?
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]

    def create
      name = professors_params[:courseName]
      description = professors_params[:courseDescription]
      unis =professors_params[:unis]

      if Course.find_by(courseName: name).nil?
        course = Course.create!({:courseName => name, :courseDescription => description})
        Entitlement.create!({:uni => current_user.uni, :courseId => course.id, :role => "Prof"})
        unis.split( /, */ ).each { |uni| Entitlement.create!({:uni => uni, :courseId => course.id, :role => "TA"})}
        TeachingAssistant.create!({:uni => current_user.uni, :class_id => course.id, :name => current_user.name})
---
INSERT INTO "teaching_assistants" ("uni", "class_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["uni", "ss5945"], ["class_id", 1], ["name", "Test"], ["created_at", "2023-10-31 22:47:36.534576"], ["updated_at", "2023-10-31 22:47:36.534576"]]