app/controllers/schedules_controller.rb

    def index
      user_id = session[:user_id]
      user = User.find_by(id: user_id)

      uni = user.uni

      classes = Entitlement.where(uni: uni).pluck(:courseId)
      @sched = Schedule.where(courseId: classes)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "entitlements"."courseId" FROM "entitlements" WHERE "entitlements"."uni" = ?  [["uni", "testUni"]]
SELECT "schedules".* FROM "schedules" WHERE "schedules"."courseId" IN ('COMS 4152', 'COMS 4111')