app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uni" = ? LIMIT 1  [["uni", "testUni"]]
---
  def create
    @user = User.find_by(uni: login_params[:uni])