app/controllers/teaching_assistants_controller.rb

SELECT "entitlements".* FROM "entitlements" WHERE "entitlements"."uni" = ? AND "entitlements"."role" = ?  [["uni", "cheems"], ["role", "TA"]]
---
  def new_office_hour
    @your_classes = Entitlement.where({uni: current_user.uni, role: ["TA", "Prof"]}).map(&:courseName)