app/controllers/teaching_assistants_controller.rb

SELECT "entitlements"."courseId" FROM "entitlements" WHERE "entitlements"."uni" = ? AND "entitlements"."role" = ?  [["uni", "cheems"], ["role", "TA"]]
---
  def new_office_hour
    @your_classes = Entitlement.where({uni: session[:user_uni], role: "TA"}).pluck(:courseId)

INSERT INTO "calendars" ("class_id", "recurrence", "start_time", "end_time", "user_id") VALUES (?, ?, ?, ?, ?)  [["class_id", "test"], ["recurrence", "0"], ["start_time", "2023-11-09 20:19:00.000000"], ["end_time", "2023-11-09 20:19:00.000000"], ["user_id", 1]]
---
  def create_office_hour
    @calendar = current_user.calendars.build(calendar_params)

    if @calendar.save

SELECT "calendars".* FROM "calendars" WHERE "calendars"."user_id" = ?  [["user_id", 1]]
---
  def edit_office_hour
    @class_ids = current_user.calendars.uniq(&:class_id).map(&:class_id).to_set

SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT 1  [["id", 16]]
UPDATE "calendars" SET "start_time" = ?, "end_time" = ? WHERE "calendars"."id" = ?  [["start_time", "2023-11-02 18:34:00.000000"], ["end_time", "2023-11-02 18:34:00.000000"], ["id", 16]]
---
  def update
    @calendar = Calendar.find(params[:id])

    if @calendar.update(calendar_params)