app/controllers/users_controller.rb

    def profile

        @viewable_courses = Set.new
        @calendars = Set.new(current_user.calendars)

        @entitlements = Entitlement.where(uni: current_user.uni)
        @entitlements.each do |entitlement|
            potential_course = Course.find_by(courseName: entitlement.courseId)
            if not potential_course.nil?
                @viewable_courses << potential_course
            end
        end
        @all_course_list = Course.pluck(:courseName)
---
SELECT "entitlements".* FROM "entitlements" WHERE "entitlements"."uni" = ?  [["uni", "testUni"]]
SELECT "entitlements".* FROM "entitlements"
SELECT  "courses".* FROM "courses" WHERE "courses"."courseName" = ? LIMIT 1  [["courseName", "1"]]
SELECT "courses"."courseName" FROM "courses"

    def create
        existing_user = User.find_by(uni: user_params[:uni])
        if existing_user
            flash[:warning] = "Inputted UNI already has an account. Please log in instead."
            redirect_to new_session_path
        else
            new_user = User.create(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."uni" = ? LIMIT 1  [["uni", "testUni"]]
INSERT INTO "users" ("uni", "name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)