app/controllers/users_controller.rb

    def profile
        @viewable_courses = Set.new
        @calendars = Set.new(current_user.calendars)
        @entitlements = Entitlement.where(uni: current_user.uni)
        @entitlements.each do |entitlement|
            @viewable_courses << Course.find_by(id: entitlement.courseId)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]